import 'package:masnoon_dua/data/dua_category.dart';
import 'package:masnoon_dua/data/dua_data.dart';

final duaName = [
  new DuaCategory(1, 'လူ့အဖွဲ့အစည်းနှင့်ဆိုင်သော', 'assets/images/social.jpg'),
  new DuaCategory(2, 'သွားလာခြင်းနှင့်ဆိုင်သော', 'assets/images/trip.jpg'),
  new DuaCategory(3, 'နမားဇ်နှင့်ဆိုင်သော', 'assets/images/namaz.png'),
  new DuaCategory(4, 'စားသောက်ခြင်းနှင့်ဆိုင်သော', 'assets/images/food.jpg'),
  new DuaCategory(
      5, 'နေ့စဉ်လှုပ်ရှားမှုနှင့်ဆိုင်သော', 'assets/images/daily.jpg'),
  new DuaCategory(6, 'ရာသီဥတုနှင့်ဆိုင်သော', 'assets/images/weather.jpg')
];

final societyDuas = [
  new Dua(
      1,
      'မုစ်လင်မ်အချင်းချင်း တွေ့ဆုံသောအခါ နှုတ်ခွန်းဆက်သရန်',
      ' اَلسَّلَامُ عَلَيْكُمْ وَرَحْمَةُ اللّٰهِ وَبَرَكَاتُهْ. ',
      'အလ္လာဟ်အရှင်မြတ်ထံတော်မှ ချမ်းသာသုခ ကရုဏာတော်နှင့် ဗရကသ် မင်္ဂလာအပေါင်းသည် သင်တို့အပေါ်သို့ သက်ရောက်ပါစေ။'),
  new Dua(
      2,
      'တစ်ဦးတစ်ယောက်ကစလာမ်ပို့သလိုက်သောအခါတုံ့ပြန်ရန်',
      'وَعَلَيْكَ وَعَلَيْهِ السَّلَامُ. ',
      'အသင်နှင့်တကွ ထိုသူ့အပေါ်အလ္လာဟ်အရှင်မြတ်ထံတော်မှ ချမ်းသာသုခသက်ရောက်ပါစေ။'),
  new Dua(
      3,
      'ဒုတိယမုစ်လင်မ်ကတုံ့ပြန်ရန်',
      'وَعَلَيْكُمُ السَّلَامُ وَرَحْمَةُ اللّٰهِ وَبَرَكَاتُهْ. ',
      'အလ္လာဟ်အရှင်မြတ်ထံမှ ချမ်းသာသုခကရုဏာတော်နှင့်ဗရကသ် မင်္ဂလာအပေါင်းသည် သင်တို့အပေါ်သို့သက်ရောက်ပါစေ။'),
];

final travelDuas = [
  new Dua(
      4,
      'အိမ်မှထွက်သောအခါ ဖတ်ရန်ဒုအာ',
      'بِسْمِ اللّٰهِ تَوَكَّلْتُ عَلَي اللّٰهِ لَاحَوْلَ وَلَاقُوَّةَاِلَّابِاللّٰهِ. ',
      'ကျွန်တော်မျိုးသည်အလ္လာဟ်အရှင်မြတ်၏နာမတော်ကိုတသ၍အိမ်မှထွက်ပါသည်။  ကျွန်တော်မျိုးသည် အလ္လာဟ်အရှင်မြတ်ကိုသာလျှင်ယုံပုံ အားထားပါသည်။  မကောင်းမှုများမှ ရှောင်ကျဉ်နိုင်စွမ်းနှင့် ကောင်းမှုကုသိုလ်များ ကျင့်ဆောင်နိုင်စွမ်းကို အလ္လာဟ်အရှင်မြတ်စောင်မတော်မူမှသာလျှင် တက်စွမ်းနိုင်ပေမည်။'),
  new Dua(
      5,
      'အိမ်သို့ဝင်သောအခါ ဖတ်ရန်ဒုအာ',
      'اَللّٰهُمَّ اِنِّيْ اَسْئَلُكَ خَيْرَ الْمَوْلَجِ وَخَيْرَ الْمَخْرَجِ بِسْمِ اللّٰهِ وَلَجْنَا وَبِسْمِ اللّٰهِ خَرَجْنَا وَعَلَي اللّٰهِ رَبِّنَاتَوَكَّلْنَا. ',
      '  အိုအလ္လာဟ်အရှင်မြတ် ကျွန်တော်မျိုးသည် အရှင်မြတ်ထံတော်မှကောင်းသောဝင်ခြင်းနှင့်ကောင်းသောထွက်ခြင်းကိုတောင်းခံပါ၏။  အလ္လာဟ်အရှင်မြတ်၏ နာမတော်ကို ရွတ်ဆို၍ ကျွန်တော်မျိုးတို့သည်ဝင်ကြပါသည်။ အလ္လာဟ်အရှင်မြတ်၏နာမတော်ကိုရွတ်ဆို၍ ကျွန်တော်မျိုးတို့သည်ထွက်ကြပါသည်။ ၎င်းပြင်ကျွန်တော်မျိုးတို့ကို မွေးမြူဖန်ဆင်းတော်မူသော အလ္လာဟ်အရှင်အပေါ်၌သာလျှင် ကျွန်တော်မျိုးတို့ယုံပုံအားထားကြပါသည်။'),
  new Dua(
      6,
      'ဗလီသို့ဝင်သောအခါဖတ်ရန်ဒုအာ',
      'اَللّٰهُمَّ افْتَحْ لِيْ اَبْوَابَ رَحْمَتِكَ. ',
      'အိုအလ္လာဟ်အရှင်မြတ် အရှင်မြတ်သည်ကျွန်တော်မျိုးအဖို့ မိမိကရုဏာတော်၏ တံခါးများကိုဖွင့်ပေးသနားတော်မူပါ။ '),
  new Dua(
      7,
      'ဗလီမှထွက်သောအခါ ဖတ်ရန်ဒိုအာ',
      'اَللّٰهُمَّ اِنِّيْ‌‌‌ اَسْئَلُكَ مِنْ فَضْلِكَ. ',
      'အို အလ္လာဟ်ရှင်မြတ် ကျွန်တော်မျိုးသည် အရှင်မြတ်ထံတော်မှ အရှင်မြတ်၏ ကျေးဇူးတော် ကိုအသနားခံပါ၏။'),
  new Dua(
      8,
      'ခရီးထွက်ရန်ရည်ရွယ်သောအခါဖတ်ရန်ဒုအာ',
      'اَللّٰهُمَّ بِكَ اَصُوْلُ وَبِكَ اَحُوْلُ وَبِكَ اَسِيْرُ.',
      'အိုအလ္လာဟ်အရှင်မြတ်ကျွန်တော်မျိုးသည်အရှင်မြတ်၏အကူအညီဖြင့်သာရန်သူတို့ကိုတိုက်ခိုက်ပါ၏။၎င်းအပြင်အရှင်မြတ်၏အကူအညီဖြင့်သာ ၎င်းတို့ပြုသောအန္တရာယ်ဟူသရွေ့ကိုဖယ်ရှားရန်ကြံရွယ်ပါ၏။၎င်းအပြင်အရှင်မြတ်၏အကူအညီဖြင့်သာကျွန်တော်မျိုးလျှောက်လှမ်းပါ၏။'),
  new Dua(
      9,
      'အစီးအနင်းစီးသောအခါဖတ်ရန်ဒုအာ',
      'اَلْحَمْدُ لِلّٰهِ. سُبْحَانَ الَّذِىْ سَخَّرَ لَنَا هٰذَا وَمَا كُنَّا لَهُ مُقْرِنِيْنَ. وَاِنَّآ اِلٰي رَبِّنَا لَمُنْقَلِبُوْنَ.',
      'ချီးမွမ်းထောပနာဟူသမျှတို့ကိုအလ္လာဟ်အရှင်မြတ်သာလျှင်ခံယူထိုက်ပါသည်။ကျွန်တော်မျိုးတို့အဖို့ဤအစီးအနင်းကိုနိုင်နင်းစေတော်မူသောအရှင်မြတ်သည်စင်ကြယ်သန့်ရှင်းတော်မူပါ၏။အမှန်စင်စစ်ကျွန်တော်မျိုးတို့သည်ဤအစီးအနင်းကိုနိုင်နင်းကြသူများမဟုတ်ပေ။ ၎င်းအပြင်ဧကန်မလွဲကျွန်တော်မျိုးတို့သည်မိမိတို့အားဖန်ဆင်းမွေးမြူတော်မူသောအရှင်မြတ်ထံတော်သို့အမှန်ပင်ပြန်သွားကြရမည်သာဖြစ်သည်။'),
  new Dua(
      10,
      'ရေလမ်းခရီးထွက်သောအခါဖတ်ရန်ဒုအာ',
      'بِاسْمِ اللّٰهِ مَجْرِيْهَا وَمُرْسٰهَا اِنَّ رَبِّىْ لَغَفُوْرٌرَّحِيْمٌ. ',
      'ဤသင်္ဘောသွားလာလှုပ်ရှားမှုသည်လည်းကောင်း|ဆိုက်ကပ်နေခြင်းသည်လည်းကောင်းအလ္လာဟ်အရှင်မြတ်၏နာမတော်ဖြင့်သာဖြစ်ပေသည်။ဧကန်မုချကျွန်တော်မျိုးအားမွေးမြူဖန်ဆင်းတော်မူသောအရှင်မြတ်သည်အမှန်ပင်အလွန်တရာလွတ်ငြိမ်းချမ်းသာခွင့်ပေးတော်မူသောအရှင်၊အလွန်တရာသနားကြင်နာတော်မူသောအရှင်ဖြစ်တော်မူသည်။'),
];

final namazDuas = [
  new Dua(
      11,
      'ဝုဇူပြုသောအခါဖတ်ရန်ဒုအာ',
      'بِاسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِيْمِ٠ بِاسْمِ اللّٰهِ الْعَظِيْمِ٠ وَالْحَمْدُ لِلّٰهِ عَلٰى دِيْنِ الْاِسْلَامِ٠',
      ''
      'အလွန်တရာသနားကြင်နာတော်မူသော အလ္လာဟ်အရှင်မြတ်၏ နာမတော်ဖြင့် အစပြုပါ၏။\nကြီးကျယ်မြင့်မြတ်တော်မူသော အလ္လာဟ်အရှင်မြတ်၏ နာမတော်ဖြင့် အစပြုပါ၏။ထို့ပြင် အစ္စလာမ်သာသနာတော်ကို ချီးမြှင့်တော်မူသည့်အတွက် ချီးမွမ်းခြင်းအပေါင်းတို့သည် အလ္လာဟ်အရှင်မြတ်အတွက်သာ ဖြစ်ကုန်၏ ။'),
  new Dua(
      12,
      'ဝုဇူပြုနေစဉ်ဖတ်ရန်ဒုအာ',
      'اَللّٰهُمَّ اغْفِرْلِيْ ذَنْبِيْ وَوَسِّعْ لِيْ فِيْ دَارِيْ وَبَارِكْ لِيْ فِيْ رِزْقِيْ.',
      'အိုအလ္လာဟ်အရှင်မြတ် ကျွန်တော်မျိုး၏ ပြစ်မှုဒုစရိုက်ကို ခွင့်လွှတ်တော်မူပါ။ ၎င်းပြင်ကျွန်တော်မျိုး၏ အိမ်တွင်းကျယ်ဝန်းမှု(ချောင်လည်မှု)ကို ပေးသနားတော်မူပါ။ ထို့ပြင်ကျွန်တော်မျိုး၏ ရိုဇီရိက္ခာတွင် ဗရကသ်တိုးပွားမှုကိုချီးမြှင့်ပေးသနားတော်မူပါ။'),
//  new Dua(13, 'ဝုဇူပြုပြီးသောအခါဖတ်ရန်ဒုအာ', '', )
];
