import 'package:masnoon_dua/data/dua_category.dart';
import 'package:masnoon_dua/data/dua_data.dart';

final duaName = [
  new DuaCategory(
    1,
    'လူ့အဖွဲ့အစည်းနှင့်ဆိုင်သော',
    'assets/images/social.jpg',
  ),
  new DuaCategory(
    2,
    'သွားလာခြင်းနှင့်ဆိုင်သော',
    'assets/images/trip.jpg',
  ),
  new DuaCategory(
    3,
    'နမားဇ်နှင့်ဆိုင်သော',
    'assets/images/namaz.png',
  ),
  new DuaCategory(
    4,
    'စားသောက်ခြင်းနှင့်ဆိုင်သော',
    'assets/images/food.jpg',
  ),
  new DuaCategory(
    5,
    'နေ့စဉ်လှုပ်ရှားမှုနှင့်ဆိုင်သော',
    'assets/images/daily.jpg',
  ),
  new DuaCategory(
    6,
    'ရာသီဥတုနှင့်ဆိုင်သော',
    'assets/images/weather.jpg',
  )
];

final societyDuas = [
  new Dua(
      1,
      'မုစ်လင်မ်အချင်းချင်း တွေ့ဆုံသောအခါ နှုတ်ခွန်းဆက်သရန်',
      ' اَلسَّلَامُ عَلَيْكُمْ وَرَحْمَةُ اللّٰهِ وَبَرَكَاتُهْ. ',
      'အလ္လာဟ်အရှင်မြတ်ထံတော်မှ ချမ်းသာသုခ ကရုဏာတော်နှင့် ဗရကသ် မင်္ဂလာအပေါင်းသည် သင်တို့အပေါ်သို့ သက်ရောက်ပါစေ။',
      sound_url:'sounds/dua-to-meet-with-muslim.mp3'),
  new Dua(
      2,
      'တစ်ဦးတစ်ယောက်ကစလာမ်ပို့သလိုက်သောအခါတုံ့ပြန်ရန်',
      'وَعَلَيْكَ وَعَلَيْهِ السَّلَامُ. ',
      'အသင်နှင့်တကွ ထိုသူ့အပေါ်အလ္လာဟ်အရှင်မြတ်ထံတော်မှ ချမ်းသာသုခသက်ရောက်ပါစေ။',
      sound_url: 'sounds/1.mp3'),
  new Dua(
      3,
      'ဒုတိယမုစ်လင်မ်ကတုံ့ပြန်ရန်',
      'وَعَلَيْكُمُ السَّلَامُ وَرَحْمَةُ اللّٰهِ وَبَرَكَاتُهْ. ',
      'အလ္လာဟ်အရှင်မြတ်ထံမှ ချမ်းသာသုခကရုဏာတော်နှင့်ဗရကသ် မင်္ဂလာအပေါင်းသည် သင်တို့အပေါ်သို့သက်ရောက်ပါစေ။',
      sound_url: 'sounds/2.mp3'),
];

final travelDuas = [
  new Dua(
      4,
      'ခရီးထွက်ရန်ရည်ရွယ်သောအခါဖတ်ရန်ဒုအာ',
      'اَللّٰهُمَّ بِكَ اَصُوْلُ وَبِكَ اَحُوْلُ وَبِكَ اَسِيْرُ.',
      'အိုအလ္လာဟ်အရှင်မြတ်ကျွန်တော်မျိုးသည်အရှင်မြတ်၏အကူအညီဖြင့်သာရန်သူတို့ကိုတိုက်ခိုက်ပါ၏။၎င်းအပြင်အရှင်မြတ်၏အကူအညီဖြင့်သာ ၎င်းတို့ပြုသောအန္တရာယ်ဟူသရွေ့ကိုဖယ်ရှားရန်ကြံရွယ်ပါ၏။၎င်းအပြင်အရှင်မြတ်၏အကူအညီဖြင့်သာကျွန်တော်မျိုးလျှောက်လှမ်းပါ၏။',
      sound_url: 'sounds/3.mp3'),
  new Dua(
      5,
      'ဗလီသို့ဝင်သောအခါဖတ်ရန်ဒုအာ',
      'اَللّٰهُمَّ افْتَحْ لِيْ اَبْوَابَ رَحْمَتِكَ. ',
      'အိုအလ္လာဟ်အရှင်မြတ် အရှင်မြတ်သည်ကျွန်တော်မျိုးအဖို့ မိမိကရုဏာတော်၏ တံခါးများကိုဖွင့်ပေးသနားတော်မူပါ။ ',
      sound_url: 'sounds/dua-for-entering-masjid.mp3'),
  new Dua(
      6,
      'ဗလီမှထွက်သောအခါ ဖတ်ရန်ဒိုအာ',
      'اَللّٰهُمَّ اِنِّيْ‌‌‌ اَسْئَلُكَ مِنْ فَضْلِكَ. ',
      'အို အလ္လာဟ်ရှင်မြတ် ကျွန်တော်မျိုးသည် အရှင်မြတ်ထံတော်မှ အရှင်မြတ်၏ ကျေးဇူးတော် ကိုအသနားခံပါ၏။',
      sound_url: 'sounds/dua-for-exiting-masjid.mp3'),
  new Dua(
      7,
      'အစီးအနင်းစီးသောအခါဖတ်ရန်ဒုအာ',
      'اَلْحَمْدُ لِلّٰهِ. سُبْحَانَ الَّذِىْ سَخَّرَ لَنَا هٰذَا وَمَا كُنَّا لَهُ مُقْرِنِيْنَ. وَاِنَّآ اِلٰي رَبِّنَا لَمُنْقَلِبُوْنَ.',
      'ချီးမွမ်းထောပနာဟူသမျှတို့ကိုအလ္လာဟ်အရှင်မြတ်သာလျှင်ခံယူထိုက်ပါသည်။ကျွန်တော်မျိုးတို့အဖို့ဤအစီးအနင်းကိုနိုင်နင်းစေတော်မူသောအရှင်မြတ်သည်စင်ကြယ်သန့်ရှင်းတော်မူပါ၏။အမှန်စင်စစ်ကျွန်တော်မျိုးတို့သည်ဤအစီးအနင်းကိုနိုင်နင်းကြသူများမဟုတ်ပေ။ ၎င်းအပြင်ဧကန်မလွဲကျွန်တော်မျိုးတို့သည်မိမိတို့အားဖန်ဆင်းမွေးမြူတော်မူသောအရှင်မြတ်ထံတော်သို့အမှန်ပင်ပြန်သွားကြရမည်သာဖြစ်သည်။',
      sound_url: 'sounds/5.mp3'),
  new Dua(
      8,
      'ရေလမ်းခရီးထွက်သောအခါဖတ်ရန်ဒုအာ',
      'بِاسْمِ اللّٰهِ مَجْرِيْهَا وَمُرْسٰهَا اِنَّ رَبِّىْ لَغَفُوْرٌرَّحِيْمٌ. ',
      'ဤသင်္ဘောသွားလာလှုပ်ရှားမှုသည်လည်းကောင်း|ဆိုက်ကပ်နေခြင်းသည်လည်းကောင်းအလ္လာဟ်အရှင်မြတ်၏နာမတော်ဖြင့်သာဖြစ်ပေသည်။ဧကန်မုချကျွန်တော်မျိုးအားမွေးမြူဖန်ဆင်းတော်မူသောအရှင်မြတ်သည်အမှန်ပင်အလွန်တရာလွတ်ငြိမ်းချမ်းသာခွင့်ပေးတော်မူသောအရှင်၊အလွန်တရာသနားကြင်နာတော်မူသောအရှင်ဖြစ်တော်မူသည်။',
      sound_url: 'sounds/6.mp3'),
  new Dua(
      9,
      'အိမ်မှထွက်သောအခါ ဖတ်ရန်ဒုအာ',
      'بِسْمِ اللّٰهِ تَوَكَّلْتُ عَلَي اللّٰهِ لَاحَوْلَ وَلَاقُوَّةَاِلَّابِاللّٰهِ. ',
      'ကျွန်တော်မျိုးသည်အလ္လာဟ်အရှင်မြတ်၏နာမတော်ကိုတသ၍အိမ်မှထွက်ပါသည်။  ကျွန်တော်မျိုးသည် အလ္လာဟ်အရှင်မြတ်ကိုသာလျှင်ယုံပုံ အားထားပါသည်။  မကောင်းမှုများမှ ရှောင်ကျဉ်နိုင်စွမ်းနှင့် ကောင်းမှုကုသိုလ်များ ကျင့်ဆောင်နိုင်စွမ်းကို အလ္လာဟ်အရှင်မြတ်စောင်မတော်မူမှသာလျှင် တက်စွမ်းနိုင်ပေမည်။',
      sound_url: 'sounds/dua-when-exiting-the-home .mp3'),
  new Dua(
      10,
      'အိမ်သို့ဝင်သောအခါ ဖတ်ရန်ဒုအာ',
      'اَللّٰهُمَّ اِنِّيْ اَسْئَلُكَ خَيْرَ الْمَوْلَجِ وَخَيْرَ الْمَخْرَجِ بِسْمِ اللّٰهِ وَلَجْنَا وَبِسْمِ اللّٰهِ خَرَجْنَا وَعَلَي اللّٰهِ رَبِّنَاتَوَكَّلْنَا. ',
      '  အိုအလ္လာဟ်အရှင်မြတ် ကျွန်တော်မျိုးသည် အရှင်မြတ်ထံတော်မှကောင်းသောဝင်ခြင်းနှင့်ကောင်းသောထွက်ခြင်းကိုတောင်းခံပါ၏။  အလ္လာဟ်အရှင်မြတ်၏ နာမတော်ကို ရွတ်ဆို၍ ကျွန်တော်မျိုးတို့သည်ဝင်ကြပါသည်။ အလ္လာဟ်အရှင်မြတ်၏နာမတော်ကိုရွတ်ဆို၍ ကျွန်တော်မျိုးတို့သည်ထွက်ကြပါသည်။ ၎င်းပြင်ကျွန်တော်မျိုးတို့ကို မွေးမြူဖန်ဆင်းတော်မူသော အလ္လာဟ်အရှင်အပေါ်၌သာလျှင် ကျွန်တော်မျိုးတို့ယုံပုံအားထားကြပါသ,ည်။'
      ,sound_url: 'sounds/dua-for-entering-house.mp3')
];

final namazDuas = [
  new Dua(
      11,
      'ဝုဇူပြုသောအခါဖတ်ရန်ဒုအာ',
      'بِاسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِيْمِ٠ بِاسْمِ اللّٰهِ الْعَظِيْمِ٠ وَالْحَمْدُ لِلّٰهِ عَلٰى دِيْنِ الْاِسْلَامِ٠',
      ''
      'အလွန်တရာသနားကြင်နာတော်မူသော အလ္လာဟ်အရှင်မြတ်၏ နာမတော်ဖြင့် အစပြုပါ၏။\nကြီးကျယ်မြင့်မြတ်တော်မူသော အလ္လာဟ်အရှင်မြတ်၏ နာမတော်ဖြင့် အစပြုပါ၏။ထို့ပြင် အစ္စလာမ်သာသနာတော်ကို ချီးမြှင့်တော်မူသည့်အတွက် ချီးမွမ်းခြင်းအပေါင်းတို့သည် အလ္လာဟ်အရှင်မြတ်အတွက်သာ ဖြစ်ကုန်၏ ။',
      sound_url: 'sounds/7.mp3'),
  new Dua(
      12,
      'ဝုဇူပြုနေစဉ်ဖတ်ရန်ဒုအာ',
      'اَللّٰهُمَّ اغْفِرْلِيْ ذَنْبِيْ وَوَسِّعْ لِيْ فِيْ دَارِيْ وَبَارِكْ لِيْ فِيْ رِزْقِيْ.',
      'အိုအလ္လာဟ်အရှင်မြတ် ကျွန်တော်မျိုး၏ ပြစ်မှုဒုစရိုက်ကို ခွင့်လွှတ်တော်မူပါ။ ၎င်းပြင်ကျွန်တော်မျိုး၏ အိမ်တွင်းကျယ်ဝန်းမှု(ချောင်လည်မှု)ကို ပေးသနားတော်မူပါ။ ထို့ပြင်ကျွန်တော်မျိုး၏ ရိုဇီရိက္ခာတွင် ဗရကသ်တိုးပွားမှုကိုချီးမြှင့်ပေးသနားတော်မူပါ။',
      sound_url: 'sounds/8.mp3'),
  new Dua(
      13,
      'ဝုဇူပြုပြီးသောအခါဖတ်ရန်ဒုအာ',
      "اَشْهَدُ اَنْ لَّااِلٰهَ اِلَّا اللّٰهُ وَحْدَهُ لَاشَرِيْكَ لَهُ وَاَشْهَدُ اَنَّ" +
          "مُحَمَّدًاعَبْدُهُ وَرَسُوْلُهُ. اَللّٰهُمَّ اجْعَلْنِيْ مِنَ التَّوَّابِيْنَ" +
          "وَاجْعَلْنِيْ مِن‌‌‌َالْمُتَطَهِّرِيْنَ. سُبْحَانَك‌َاللّٰهُمَّ وَبِحَمْدِكَ" +
          "اَشْحَدُاَنْ لَّااِلٰهَ اِلَّااَنْتَ اَسْتَغْفِرُكَ وَاَتُوْبُ اِلَيْكَ.",
      "အလ္လာဟ်အရှင်မြတ်မှတပါး အခြားခဝပ်ကိုးကွယ်ထိုက်သော အရှင်မရှိကြောင်းကို ကျွန်တော်မျိုးသက်သေခံအပ်ပါသည်။ထိုအရှင်မြတ်သည် တပါးတည်းတည်ရှိတော်မူသည်။ထို့ပြင် မိုဟမ္မဒ်သခင်(ဆွ)သည် အလ္လာဟ်အရှင်မြတ်၏ ဗန်ဒဟ်နှင့် ထိုအရှင်မြတ်၏ရစူလ် (စေတမန်တော်) ဖြစ်ကြောင်းကို ကျွန်တော်မျိုးသက်သေခံအပ်ပါသည်။\nအိုအလ္လာဟ်အရှင်မြတ် ကျွန်တော်မျိုးအား များစွာသောဝ်ဗဟ်ပြုသည့် အုပ်စုဖြစ်စေတော်မူပါ။\nအလ္လာဟ်ရှင်မြတ်သည်ချို့တဲ့ခြင်းအပေါင်းမှ ကင်းရှင်းတော်မူကြောင်းကို ကျွန်တော်မျိုးသက်သေခံအပ်ပါသည်။ ထို့နောက်ချီးမွမ်းခြင်းအပေါင်းသည် အရှင်မြတ်အဖို့သာဖြစ်ပေသည်။ အရှင်မြတ်မှတပါး အခြားခဝပ်ကိုးကွယ်ထိုက်သော အရှင်မရှိကြောင်းကိုကျွန်တော်မျိုးသက်သေခံအပ်ပါသည်။ကျွန်တော်မျိုးသည် အရှင်မြတ်ထံတော်မှလွတ်ငြိမ်းချမ်းသာခွင့်ကိုတောင်းခံပါသည်။ ၎င်း ကျွန်တော်မျိုးသည် အရှင်မြတ်ဘက်သို့သာ ပြန်လှည့်အပ်ပါသည်။",
      sound_url: 'sounds/9.mp3'),
  new Dua(
      14,
      'ဖရ်ဇ်နမာဇ်စလာမ်လှည့်ပြီးသောအခါ နဖူးပေါ်ယာလက်တင်၍ ဖတ်ရန်ဒုအာ',
      '   بِاسْمِ اللّٰهِ الَّذِيْ لَٓااِلٰهَ اِلَّاهُوَ الرَّحْمٰنُ الرَّ حِيْمُ. اَللّٰهُمَّ اَذْهِبْ عَنِّي الْهَمَّ وَالْحُزْنَ. ',
      ' ကျွန်တော်မျိုးသည်အလ္လာဟ်အရှင်မြတ်၏ နာမတော်ဖြင့်အစပြုပါ၏ ။ထိုအလ္လာဟ်အရှင်မြတ်မှတပါး ခဝပ်ကိုးကွယ်ရာအရှင်ဟူ၍ အလျင်းမရှိ၊ ထိုအရှင်သည် အနန္တကရုဏာတော်ရှင်၊ အလွန်သနားကြင်နာညှာတာတော်မူသောအရှင်မြတ်ဖြစ်တော်မူ၏ ။အိုအလ္လာဟ်အရှင် သောကအပေါင်းတို့ကိုလည်းကောင်း၊ ဝမ်းနည်းပူဆွေးမှုအပေါင်းတို့ကိုလည်းကောင်း ကျွန်တော်မျိုးမှဖယ်ရှားပေးတော်မူပါ။',
      sound_url: 'sounds/11.mp3')
];
final foodDuas = [
  new Dua(
      15,
      'ထမင်းစားသောအခါ ဖတ်ရန်ဒိုအာ',
      'بِاسْمِ اللّٰهِ وَعَلٰي بَرَكَةِ اللّٰهِ. ',
      'ကျွန်တော်မျိုးသည် အလ္လာဟ်အရှင်မြတ်၏ နာမတော်ဖြင့်လည်းကောင်း ထိုအရှင်မြတ်၏ဘရကသ်မင်္ဂလာကို မျှော်ကိုး၍လည်ကောင်း အစပြုစားသုံးပါ၏။',
      sound_url: 'sounds/dua-before-eating.mp3'),
  new Dua(
      16,
      'ဗိစ္စမိလ္လာဟ်ဆိုရန်မေ့သွား၍ သတိရသောအခါ ဖတ်ရန်ဒိုအာ',
      'بِسْمِ اللّٰهِ اَوَّلَهُ و‌اٰخِر‌َهُ',
      'ကျွန်တော်မျိုးသည် ဤစားသုံးခြင်း၏အစ၍လည်ကောင်း အဆုံး၍လည်ကောင်း၊ အလ္လာဟ်အရှင်မြတ်၏ နာမတော်ကိုတသပါ၏။',
      sound_url: 'sounds/12.mp3'),
  new Dua(
      17,
      'ထမင်းစားနေစဉ် ဖတ်ရန်ဒိုအာ',
      'اَللّٰهُمَّ لَكَ الْحَمْدُ وَلَكَ الشُّكْرُ. ',
      'အို အလ္လာဟ်အရှင်မြတ် ချီးမွမ်းခြင်းအပေါင်းတို့သည်လည်းကောင်း၊ ကျေးဇူးတရားသည်လည်းကောင်း၊အလ္လာဟ်အရှင်မြတ်အတွက်သာလျှင် ဖြစ်ကုန်၏။',
      sound_url: 'sounds/13.mp3'),
  new Dua(
      18,
      'ထမင်းစားပီးသောအခါ ဖတ်ရန်ဒိုအာ',
      'اَلْحَمْدُ لِلّٰهِ الَّذِيْ اَطْعَمَنَا و‌َسَقَانَا وَجَعَلَنَا مِنَ الْمُسْلِمِيْنَ. ',
      'ချီးမွမ်းထောပနာ အပေါင်းကိုအလ္လာဟ်အရှင်မြတ်သာလျှင် ခံယူထိုက်တော်မူ၏။ထိုအရှင်မြတ်သည် ကျွန်တော်မျိုးတို့အားကျွးမွေးခဲ့တော်မူ၏။၎င်းအပြင်ထိုအရှင်မြတ်သည် ကျွန်တော်မျိုးတို့အား သောက်သုံးစေတော်မူခဲ့၏။၎င်းအပြင် ထိုအရှင်မြတ်သည် ကျွန်တော်မျိုးတို့အား မုစ်လင်မ်တို့ အနက်မှ ဖြစ်စေတော်မူခဲ့၏။',
      sound_url: 'sounds/dua-after-eating.mp3'),
  new Dua(
      19,
      'ဒအ်ဝသ်ထမင်းစားပီးသောအခါ ဖတ်ရန်ဒိုအာ',
      'اَللّٰهُمَّ اَطْعِمْ مَّنْ اَطْعَمَنِيْ وَاسْقِ مَنْ سَقَانِيْ. ',
      'အိုအလ္လာဟ်အရှင်မြတ် ကျွန်တော်မျိုးအား ကျွေးမွေးသူကို ကျွေးမွေးတော်မူပါ။ထိုပြင်တဝ ကျွန်တော်မျိုးကို တိုက်ကျွေးသောသူအား အရှင်မြတ် တိုက်ကျွေးတော်မူပါ။',
      sound_url: 'sounds/dua-after-eating-dawat .mp3'),
  new Dua(
      20,
      'နို့သောက်သောအခါဖတ်ရန်ဒိုအာ',
      'اَللّٰهُمَّ بَارِكْ لَنَا فِيْهِ وَزِدْنَا مِنْهُ. ',
      'အို အလ္လာဟ်အရှင်မြတ် အရှင်မြတ်သည် ကျွန်တော်မျိုးတို့အဖို့ ဤနို့တွင်ဘရ်ကသ်မင်္ဂလာပေးသနားတော်မူပါ။ ထို့ပြင်တဝ အရှင်မြတ်သည် ကျွန်တော်မျိုးတို့အား ထိုထက်ပို၍ ချီးမြှင့်ပေးသနားတော်မူပါ။',
      sound_url: 'sounds/dua-before-drinking-milk.mp3'),
  new Dua(
      21,
      'ရေသောက်ပြီးသောအခါဖတ်ရန်ဒုအာ',
      'اَلْحَمْدُ لِلّٰهِ الَّذِيْ سَقَانَا عَذْبًا فُرَاتًا بِرَحْمَتِهِ وَلَمْ يَجْعَلْهُ مِلْحًااُجَاجًا بِذُنُوْبِنَا. ',
      'ချီးမွမ်းထောပနာအပေါင်းတို့သည် အကြင်အလ္လာဟ် အရှင်မြတ်အတွက်သာဖြစ်ကုန်၏ ထိုအရှင်သည် မိမိအသနားတော်ဖြင့်ကျွန်တော်မျိုးတို့အား ချိုမြိန်၍ကာင်းမွန်သောရေတို့ကို တိုက်ကျွေးတော်မူသည်။ထို့ပြင်၎င်းရေကိုကျွန်တော်မျိုးတို့၏ အပြစ်ဂုနာဟ်များကြောင့် ငန်၍ခါးသော ရေအဖြစ်မပြုလိုက်ပေ,။',
      sound_url: 'sounds/dua-after-drinking-water.mp3'),
  new Dua(
      22,
      'ဇမ်ဇမ်ရေသောက်သောအခါဖတ်ရန်ဒုအာ',
      'اَللّٰهُمَّ  اِنِّيْ اَسْئَلُكَ عِلْمًانَّافِعًا وَّرِّزْقًاوَّاسِعًاوَّشِفَاءًمِّنْ كُلِّ دَاءٍ. ',
      'အိုအလ္လာဟ်အရှင်မြတ် ဧကန်မုချကျွန်တော်မျိုးသည် အရှင့်ထံတော်မှအကျိုးပြုသောပညာရပ်၊ ချောင်လည်သောရိုဇီရိက္ခာနှင့် ရောဂါဟူသရွှေ့ မှကင်းစင်ခြင်းကိုတောင်းခံပါ၏။',
      sound_url: 'sounds/14.mp3')
];
final dailyDuas = [
  new Dua(
      23,
      'အိပ်ယာဝင်သောအခါဖတ်ရန် ဒုအာ',
      'اَللّٰهُمَّ بِاسْمِكَ اَمُوْتُ وَاَحْيٰ. ',
      'အိုအလ္လာဟ် အရှင်မြတ် ကျွန်တော်မျိုးသည် အရှင်မြတ်၏ နာမတော်နှင့် အသက်သေဆုးံမည်ဖြစ်ပါသည်။ ထို့အပြင်ကျွန်တော်မျိုးသည် အရှင်မြတ်၏ နာမတော်နှင့်ပင် အသက်ရှင်လျက်နေပါသည်။',
      sound_url: 'sounds/dua-before-sleeping.mp3'),
  new Dua(
      24,
      'အိပ်ယာမှထသောအခါ ဖတ်ရန်ဒုအာ',
      'اَلْحَمْدُ لِلّٰهِ الَّذِيْ اَحْيَانَا بَعْدَ مَا اَمَاتَنَا وَاِلَيْهِ النُّشُوْرُ. ',
      'ချီးမွမ်းထောပနာဟူသမျှတို့ကို အကြင် အလ္လာဟ်အရှင်မြတ်သာလျှင်ခံယူ ထိုက်တော်မူ၏ ထိုအရှင်မြတ်သည် ကျွန်တော်မျိုးတို့အား အသက် သေဆုးံခြင်းမှ ရှင်ပြန်ထစေတော်မူခဲ့၏။ ၎င်းပြင် ထိုအရှင်မြတ်ထံတော်သို့ပင် ရှင်ပြန်၍ သွားကြရမည်ဖြစ်သည်။',
      sound_url: 'sounds/dua-after-waking-up-from-sleep.mp3'),
  new Dua(
      25,
      'အိမ်သာသို့မဝင်မီဖတ်ရန်ဒုအာ',
      ' بِاسْمِ اللّٰهِ ، اَللّٰهُمَّ إِنِّيْ اَعُوْذُ بِكَ مِنَ الْخُبُثِ وَالْخَبَائِثِ. ',
      'အလ္လာဟ်အရှင်မြတ်၏ နာမတော်ဖြင့့်အစပြုပါ၏။ အို အလ္လာဟ်အရှင်မြတ် ဧကန်မုချကျွန်တော်မျိုးသည် မကောင်းဆိုးဝါးဖြစ်သော ဂျင်န်အဖို များနဲ့ ဂျင်န်မများ၏ နှောင့်ယှက်မှုများမှ လွတ်ကင်းရန် အရှင်မြတ်ထံတော်သို့ခိုလှုံပါ၏။',
      sound_url: 'sounds/dua-before-entering-the-toilet.mp3'),
  new Dua(
      26,
      'အိမ်သာမှဆင်းသောအခါဖတ်ရန်ဒုအာ',
      'غُفْرَانَكَ، اَلْحَمْدُ لِلّٰهِ الَّذِيْ أَذْهَبَ عَنِّي الْأَذٰى وَعَافَانِيْ.',
      'အို အလ္လာဟ်အရှင်မြတ် ကျွန်တော်မျိုးသည် အရှင်မြတ်၏လွတ်ငြိမ်းချမ်းသာခွင့်ကို အသနားခံပါသည်။ချီးမွမ်းထောပနာ အပေါင်းတို့သည် အကြင်အရှင်မြတ်သာလျှင် ခံယူထိုက်တော်မူ၏ ထိုအရှင်မြတ်သည် ကျွန်တော်မျိုးထံမှ ဥပါဒ်ဖြစ်စေသော အညစ်ကြေးများကိုဖယ်ရှားတော်မူ၍ ကျွန်တော်မျိုးအား ချမ်းသာသုခအဝဝကို ပေးသ,နားမူပေသည်။',
      sound_url: 'sounds/dua-after-exiting-from-the-toilet.mp3'),
  new Dua(
      27,
      'အဝတ်စားဝတ်သောအခါဖတ်ရန်ဒုအာ',
      'اَلْحَمْدُلِلَّهِ الَّذِيْ كَسَانِيْ هٰذَا وَرَزَقَنِيْهِ مِنْ غَيْرِ حَوْلٍ مِنِّيْ وَلَا قُوَّةٍ. ',
      'ချီးမွမ်းထောပနာဟူသမျှတို့ကို အကြင်အလ္လာဟ်အရှင်မြတ်သာလျှင် ခံယူထိုက်တော်မူ၏။ ထိုအရှင်မြတ်သည်ကျွန်တော်မျိုးအား ဤအဝတ်စားကိုဝတ်ဆင်စေတော်မူသည်။ ထို့အပြင်ကျွန်တော်မျိုး၏ ကြိုးပမ်းမှုနှင့် ခွန်အားတစုံတရာမပါဝင်ဘဲ ကျွန်တော်မျိုးအား ဤအဝတ်ကိုပေးသနားတော်မူသည်။',
      sound_url: 'sounds/dua-after-wearing-clothes.mp3'),
  new Dua(
      28,
      'မှန်ကြည့်သောအခါဖတ်ရန်ဒုအာ',
      'اَللّٰهُمَّ  أَنْتَ حَسَّنْتَ خَلْقِىْ فَحَسِّنْ خُلُقِيْ.',
      'အိုအလ္လာဟ်အရှင်မြတ် အရှင်မြတ်သည်ကျွန်တော်မျိုး၏ရုပ်ဆင်းသဏ္ဍန်ကို ကောင်းမွန်လှပစွာဖန်ဆင်းထားတော်မူပါသည်။သို့ရှိရာကျွန်တော်မျိုး၏ စာရိတ္တကိုလည်းကောင်းမွန်စေတော်မူပါ။',
      sound_url: 'sounds/dua-for-when-looking-in-a-mirror.mp3')
];
final weatherDuas = [
  new Dua(
      29,
      'မိုးချုန်းသောအခါဖတ်ရန်ဒုအာ',
      'اَللّٰهُمَّ لَاتَقْتُلْنَا بِغَضَبِكَ وَلَاتُهْلِكْناَ بِعَذَابِكَ وَعَافِناَ قَبْلَ ذٰلِكَ. ',
      'အို အလ္လာဟ်အရှင်မြတ် ကျွန်တော်မျိုးတို့အား မိမိအမျက်တော်ဖြင့် သေကြေပျက်စီးအောင် ပြုတော်မမူပါနှင့်။၎င်းပြင် အရှင်မြတ်၏ အဇားဗ်ပြစ်ဒဏ်များဖြင့် ကျွန်တော်မျိုးတို့အား ပျက်စီးအောင် ပြုတော်မမူပါနှင့်။၎င်းပြင် ထိုထက်အလျင်ကျွန်တော်မျိုးတို့အားချမ်းသာသုခပေးသနားတော်မူပါ။',
      sound_url: 'sounds/dua-when-clouds-thunder.mp3'),
  new Dua(30, 'မိုးရွာသောအခါဖတ်ရန်ဒုအာ', 'اَللّٰهُمَّ صَيِّبًانَّافِعًا.',
      'အိုအလ္လာဟ်အရှင် ဤမိုးကိုသည်းထန်စွာရွာသွန်းသောမိုးနှင့်အကျိုးဖြစ်ထွန်းစေသောမိုးဖြစ်စေသောမူပါ။',
      sound_url: 'sounds/dua-at-the-time-of-rain.mp3')];
